In [1]:
from pandas import Series,DataFrame

In [2]:
import pandas as pd
import numpy as np

In [3]:
from datetime import datetime

In [4]:
now=datetime.now()

In [5]:
now

datetime.datetime(2018, 8, 27, 9, 23, 20, 235763)

In [6]:
now.year

2018

In [7]:
delta=datetime(2011,1,7)-datetime(2008,6,25,8,15)

In [8]:
delta

datetime.timedelta(925, 56700)

In [9]:
delta.days

925

In [11]:
delta.seconds

56700

In [12]:
from datetime import timedelta

In [13]:
start=datetime(2011,1,7)

In [14]:
start+timedelta(12)

datetime.datetime(2011, 1, 19, 0, 0)

In [16]:
start-2*timedelta(12)

datetime.datetime(2010, 12, 14, 0, 0)

In [4]:
frame=DataFrame(np.random.randn(4,3),columns=list('bde'),index=['Utah','Ohio','Texas','Oregon'])

In [5]:
np.abs(frame)

               b         d         e
Utah    0.784533  0.813599  0.389357
Ohio    0.379081  0.734481  0.151546
Texas   0.009754  0.736691  1.988201
Oregon  0.493789  1.396146  0.477176

In [7]:
f=lambda x: x.max() - x.min()

In [8]:
f

In [9]:
frame.apply(f)

b    1.278322
d    2.209745
e    2.465377
dtype: float64

In [10]:
frame.apply(f,axis=1)

Utah      0.424241
Ohio      0.886027
Texas     1.978447
Oregon    0.918971
dtype: float64

In [12]:
def f(x):
    return Series([x.min(),x.max()], index=['min','max'])
frame.apply(f)

            b         d         e
min -0.784533 -0.813599 -1.988201
max  0.493789  1.396146  0.477176

In [13]:
format=lambda x: '%.2f' % x
frame.applymap(format)

            b      d      e
Utah    -0.78  -0.81  -0.39
Ohio    -0.38  -0.73   0.15
Texas   -0.01  -0.74  -1.99
Oregon   0.49   1.40   0.48

In [14]:
frame['e'].map(format)

Utah      -0.39
Ohio       0.15
Texas     -1.99
Oregon     0.48
Name: e, dtype: object

In [15]:
obj=Series(range(4), index=['d','a','b','c'])
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [17]:
frame=DataFrame(np.arange(8).reshape((2,4)),index=['three','one'],columns=['d','a','b','c'])
frame.sort_index()
frame.sort_index(axis=1)
#数据默认是升序，可以使用ascending降序
frame.sort_index(axis=1,ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [21]:
frame = DataFrame({'b':[4,7,-3,2],'a':[0,1,0,1]})
#frame.sort_index(by='b')#不再推荐使用该方法
#frame.sort_values(by='b')
#多列排序
frame.sort_index(by=['a','b'])

E:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:5: FutureWarning: by argument to sort_index is deprecated, please use .sort_values(by=...)
  """

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

In [24]:
obj=Series([7,-5,7,4,2,0,7])
obj.rank()

0    6.0
1    1.0
2    6.0
3    4.0
4    3.0
5    2.0
6    6.0
dtype: float64

In [25]:
obj.rank(method='first')
#按降序排名
obj.rank(ascending=False, method='max')

0    3.0
1    7.0
2    3.0
3    4.0
4    5.0
5    6.0
6    3.0
dtype: float64

In [27]:
frame=DataFrame({'b':[4.3,7,-3,2],'a':[0,1,0,1],'c':[-2,5,8,-2.5]})

In [28]:
frame

     b  a    c
0  4.3  0 -2.0
1  7.0  1  5.0
2 -3.0  0  8.0
3  2.0  1 -2.5

In [29]:
frame.rank(axis=1)

     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0

In [30]:
obj=Series(range(5), index=['a','a','b','b','c'])
obj.index.is_unique

False

In [31]:
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [32]:
obj['a']
obj['c']

4

In [33]:
df=DataFrame(np.random.randn(4,3),index=['a','a','b','b'])

In [34]:
df

          0         1         2
a -0.632236  0.674185  0.459863
a -1.141639  0.100355  0.585552
b -0.625328  0.600985  1.773052
b -0.496547  1.285372 -0.581484

In [37]:
df.ix['b']

E:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

          0         1         2
b -0.625328  0.600985  1.773052
b -0.496547  1.285372 -0.581484

In [38]:
df.loc['b']

          0         1         2
b -0.625328  0.600985  1.773052
b -0.496547  1.285372 -0.581484

In [41]:
df.iloc[0]

0   -0.632236
1    0.674185
2    0.459863
Name: a, dtype: float64

In [42]:
df=DataFrame([[1.4,np.nan],[7.1,-4.5],[np.nan,np.nan],[0.75,-1.3]],index=['a','b','c','d'],columns=['one','two'])

In [43]:
df.sum(axis=1)

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [44]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [45]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [46]:
df.mean(axis=1, skipna=False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [47]:
df.idxmax()

one    b
two    d
dtype: object

In [48]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [49]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [50]:
obj=Series(['a','a','b','b','c'] * 4)

In [51]:
obj

0     a
1     a
2     b
3     b
4     c
5     a
6     a
7     b
8     b
9     c
10    a
11    a
12    b
13    b
14    c
15    a
16    a
17    b
18    b
19    c
dtype: object

In [52]:
obj.describe()

count     20
unique     3
top        a
freq       8
dtype: object

In [53]:
obj=Series(['c','a','d','a','a','b','b','c','c'])

In [54]:
uniques=obj.unique()

In [55]:
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [56]:
obj.value_counts()

a    3
c    3
b    2
d    1
dtype: int64

In [57]:
pd.value_counts(obj.values, sort=False)

c    3
b    2
a    3
d    1
dtype: int64

In [58]:
mask = obj.isin(['b','c'])

In [59]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

In [60]:
string_data=Series(['aardvark','artichoke',np.nan,'avocado'])

In [61]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [62]:
string_data[0]=None

In [63]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [75]:
data=Series([1,np.nan,3.5,np.nan,7])

In [77]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [73]:
data.dropna(inplace=True)

In [74]:
data

0    1.0
2    3.5
4    7.0
dtype: float64

In [71]:
help(data.dropna)

Help on method dropna in module pandas.core.series:

dropna(axis=0, inplace=False, **kwargs) method of pandas.core.series.Series instance
    Return a new Series with missing values removed.

    See the :ref:`User Guide <missing_data>` for more on which values are
    considered missing, and how to work with missing data.

    Parameters
    ----------
    axis : {0 or 'index'}, default 0
        There is only one axis to drop values from.
    inplace : bool, default False
        If True, do operation inplace and return None.
    **kwargs
        Not in use.

    Returns
    -------
    Series
        Series with NA entries dropped from it.

    See Also
    --------
    Series.isna: Indicate missing values.
    Series.notna : Indicate existing (non-missing) values.
    Series.fillna : Replace missing values.
    DataFrame.dropna : Drop rows or columns which contain NA values.
    Index.dropna : Drop missing indices.

    Examples
    --------
    >>> ser = pd.Series([1., 2., np.nan])
    >>> ser
    0    1.0
    1    2.0
    2    NaN
    dtype: float64

    Drop NA values from a Series.

    >>> ser.dropna()
    0    1.0
    1    2.0
    dtype: float64

    Keep the Series with valid entries in the same variable.

    >>> ser.dropna(inplace=True)
    >>> ser
    0    1.0
    1    2.0
    dtype: float64

    Empty strings are not considered NA values. ``None`` is considered an
    NA value.

    >>> ser = pd.Series([np.NaN, 2, pd.NaT, '', None, 'I stay'])
    >>> ser
    0       NaN
    1         2
    2       NaT
    3
    4      None
    5    I stay
    dtype: object
    >>> ser.dropna()
    1         2
    3
    5    I stay
    dtype: object

In [67]:
data[data.isnull()]

1   NaN
3   NaN
dtype: float64

In [80]:
data=DataFrame([[1.,6.5,3.],[1.,np.nan,np.nan],[np.nan,np.nan,np.nan],[np.nan,6.5,3.]])

In [81]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [82]:
cleaned=data.dropna()

In [83]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [84]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [85]:
data[4]=np.nan

In [86]:
data.dropna(axis=1,how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [87]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [88]:
df.fillna(0)

    one  two
a  1.40  0.0
b  7.10 -4.5
c  0.00  0.0
d  0.75 -1.3

In [98]:
df.fillna({'a':0.5, 'c':-1},axis=0)

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [90]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [99]:
_=df.fillna(0, inplace=True)

In [101]:
df

    one  two
a  1.40  0.0
b  7.10 -4.5
c  0.00  0.0
d  0.75 -1.3

In [102]:
df=DataFrame(np.random.randn(6,3))

In [103]:
df.ix[2:, 1]=np.nan; df.ix[4:, 2]=np.nan

E:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

In [104]:
df

          0         1         2
0  1.624502  0.615449  0.324164
1  0.828372 -0.211069 -0.257218
2  0.922263       NaN  0.597013
3 -2.347367       NaN  0.483146
4 -0.102592       NaN       NaN
5 -0.288320       NaN       NaN

In [105]:
df.fillna(method='ffill')

          0         1         2
0  1.624502  0.615449  0.324164
1  0.828372 -0.211069 -0.257218
2  0.922263 -0.211069  0.597013
3 -2.347367 -0.211069  0.483146
4 -0.102592 -0.211069  0.483146
5 -0.288320 -0.211069  0.483146

In [106]:
df.fillna(method='ffill', limit=2)

          0         1         2
0  1.624502  0.615449  0.324164
1  0.828372 -0.211069 -0.257218
2  0.922263 -0.211069  0.597013
3 -2.347367 -0.211069  0.483146
4 -0.102592       NaN  0.483146
5 -0.288320       NaN  0.483146

In [107]:
data=Series([1., np.nan, 3.5, np.nan, 7])

In [108]:
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [109]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [112]:
data=Series(np.random.randn(10),index=[['a','a','a','b','b','b','c','c','d','d'],[1,2,3,1,2,3,1,2,2,3]])

In [113]:
data

a  1    0.567476
   2    0.582416
   3    0.734440
b  1   -0.596905
   2   -0.254039
   3   -0.670222
c  1   -1.668175
   2    1.430378
d  2    2.134947
   3    1.361633
dtype: float64

In [114]:
data.index

MultiIndex(levels=[['a', 'b', 'c', 'd'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1, 2, 2, 3, 3], [0, 1, 2, 0, 1, 2, 0, 1, 1, 2]])

In [115]:
data['b']

1   -0.596905
2   -0.254039
3   -0.670222
dtype: float64

In [116]:
data['b':'c']

b  1   -0.596905
   2   -0.254039
   3   -0.670222
c  1   -1.668175
   2    1.430378
dtype: float64

In [117]:
data.ix[['b','d']]

E:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

b  1   -0.596905
   2   -0.254039
   3   -0.670222
d  2    2.134947
   3    1.361633
dtype: float64

In [118]:
data[:,2]

a    0.582416
b   -0.254039
c    1.430378
d    2.134947
dtype: float64

In [119]:
data.unstack()

          1         2         3
a  0.567476  0.582416  0.734440
b -0.596905 -0.254039 -0.670222
c -1.668175  1.430378       NaN
d       NaN  2.134947  1.361633

In [120]:
data.unstack().stack()

a  1    0.567476
   2    0.582416
   3    0.734440
b  1   -0.596905
   2   -0.254039
   3   -0.670222
c  1   -1.668175
   2    1.430378
d  2    2.134947
   3    1.361633
dtype: float64

In [127]:
frame=DataFrame({'a':range(7),'b':range(7,0,-1),'c':['one','one','one','two','two','one','two'],'d':[0,1,2,0,1,2,3]})

In [123]:
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [124]:
frame2=frame.set_index(['c','d'])

In [125]:
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [128]:
frame.set_index(['c','d'], drop=False)

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
one 2  5  2  one  2
two 3  6  1  two  3

In [129]:
frame2.reset_index()

     c  d  a  b
0  one  0  0  7
1  one  1  1  6
2  one  2  2  5
3  two  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1

In [130]:
ser=Series(np.arange(3.))

In [131]:
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [133]:
ser[1]

1.0

In [134]:
ser.ix[:1]

E:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

0    0.0
1    1.0
dtype: float64